Revit 2024 API
DirectShapeReferenceOptions Methods
The DirectShapeReferenceOptions type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetExternalGeometryId
 Retrieves the ExternalGeometryId associated with the reference object.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsValidExternalGeometryId
 Validates that the input ExternalGeometryId can be assigned to a direct shape reference.
IsValidReferenceName
 Validates that the input name can be assigned to a direct shape reference.
SetExternalGeometryId
 Sets the ExternalGeometryId associated with the reference object. The ID must be non-empty.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
DirectShapeReferenceOptions Class
Autodesk.Revit.DB Namespace